## 팀 구성원, 개인 별 역할

---

아이디어톤 팀 구성원을 기재해 주시고, 그 주의 팀원이 어떤 역할을 맡아서 개발을 진행했는지 구체적으로 작성해 주세요. 🙂 

PM : 김민지 - 챌린지 전체 조회, 상세 조회 개발

CTO : 변흥섭 - 구글 로그인 개발

인프라 : 곽철민 - GitHub 로그인 개발

개발1 : 박정훈 - 챌린지 생성, 수정, 삭제 개발

개발2 : 이도현 - Spring Rest Docs 

## 팀 내부 회의 진행 회차 및 일자

---

- 1회차(2022.01.16) 디스코드
    - ERD 설계
    - 기능 구체화
- 2회차(2022.01.17) 디스코드(김민지님 불참)
    - API 명세서
    - 기능 명세서
    - 엔티티 정의서
- 3회차(2022.01.18) 디스코드
    - DB, 서버 Ec2 생성
    - CI/CD 구축
    - 코드 컨벤션
    - git branch 논의
- 4회차(2022.01.19) 디스코드
    - exceptionHandler 구현
    - 기능 개발 역할 분담
    

## 현재까지 개발 과정 요약 (최소 500자 이상)

---

현재까지 개발을 진행하면서 ‘기술적으로 새로 알게된 점, 어려웠던 점, 아쉬운 점' 등을 요약하여 작성해 주세요 🙂

팀원 각자 현재 구현하고 있는 것을 적어주세요. :)

- 곽철민(인프라/개발) : 이번 주차에 가장 많이 했던 고민은 엔티티를 도출하고 ERD를 설계하는 부분이었던 것 같습니다. 특히, 유저와 챌린지 간의 관계는 다대다 관계로 판단하여, 1:N, N:1로 풀어 낼 수 있었습니다. 이러한 과정을 바탕으로, 엔티티 간의 관계를 도출해내며 ERD를 완성시킬 수 있었습니다. 또한, CI/CD와 깃허브 소셜 로그인을 구현 하였습니다. CI/CD는, DB 서버와 스프링 부트 서버를 분리하여 구축하였습니다. 깃허브 소셜 로그인은 동작 과정을 파악하는 것이 어려웠지만, 하나씩 파악하며 구현해낼 수 있었습니다. ([깃허브 로그인 구현](https://www.notion.so/4bc713a63ddc450cb09c2da4e46786b7))
- 김민지(PM/개발) : 기획을 처음부터 진행하다보니 ERD, 기능 명세서, API 등 정하는 과정이 어려웠습니다. 또 개발을 시작하기 전 기능을 분배도 어떻게 해야 충돌이 나지 않고 효율적인지 어려웠습니다. 현재 Challenge 전체 조회 및 상세조회를 개발하는 과정을 진행하고 있습니다. 추후에 해시태그 기능 구현 후 해시태그로 검색하는 기능을 더 추가할 예정입니다. 현재 전체 조회시 무한스크롤 기능을 도입하려고 하고 있습니다.
- 박정훈(개발) : ERD에서 가장 많은 고민이 나왔습니다. 챌린지를 시작하고, 함께하고, 공유하며 소통하는 시스템이라 상호작용이 많아서 그런것 같습니다. 하지만 그 과정을 구체화하면서 좋은 결과를 냈습니다. 현재 게시판 생성/수정/삭제를 진행중이고, 간단한 html 페이지를 만들어 테스트를 하고 있습니다.
- 변흥섭(CTO): 처음으로 웹 프로젝트를 진행하면서 어디서부터 어떻게 진행할지가 막막했지만 팀원들과 ERD와 API를 문서화하면서 틀을 잡을 수 있엇습니다. 현재 Oauth2를 적용하기 위해 환경구축과 중복 로그인을 막기위해 JWT를 DB에 저장해서 사용하는 것이 아닌 Session 리소스를 Redis에 관리하는 방법을 익히고 있고 그것을 사용하여 중복 로그인을 막을 수 있는 방법을 생각하고 있습니다.
- 이도현(개발) : 막막했지만 챌린지를 진행하며 함께 뼈대를 잡기 위해 오랜 시간 고민했던 것 같습니다. 서버 연동과 배포를 시도하고 공유하며 git 사용법도 더 익힐 수 있었습니다. 그리고 컨트롤러에서의 코드 가독성을 높이기 위해 레스트 독스를 도입하려고 합니다. 현재는 문서를 살펴보면서 레스트 독스 문서의 생성 과정과 아스키독 작성법을 공부하고 있습니다. 또 레스트 독스 생성을 위한 시범 컨트롤러와 서비스, 테스트 코드를 작성해 보며 테스트 문법을 복습하고 있습니다. 어떤 툴이나 기술을 사용하고자 할 때는 그 장단점을 파악하는 것이 필요하다는 점을 알 수 있었고, 개발은 직접 많이 써 봐야 원리나 적용 방법이 계속 궁금해진다는 것도 많이 느낄 수 있었습니다.

## 개발 과정에서 나왔던 질문 (최소 200자 이상)

---

- pipeline push fail → 프로젝트 access Token 설정 후 password로 지정

- 레디스를 소셜 로그인에도 활용한다고 했는데, 어떻게 활용할 수 있을까요?
    - 답변 : 단순히 소셜 로그인만 구현한다면, 세션이 내장 톰캣 메모리에 저장되기 때문에 애플리케이션을 재실행하면 로그인이 풀리게 됩니다. 따라서, 레디스를 ************************세션 저장소************************로서 활용할 수 있습니다.
- 저희 서비스는 깃허브, 구글 로그인을 제공하려고 합니다. 이 때, 중복 로그인을 처리하려면 깃허브, 구글 모두 공통값이면서 유일한 값이 필요할 것 같은데, 이 상황에서 중복 로그인을 처리 할 다른 방안은 어떤게 있는지 궁금합니다.

- 성능 테스트 툴이 어떤 게 있는지 궁금합니다

- 챌린지 전체조회/상세 조회시 HashTag를 불러오는데 이 경우를 위해서는 양방향 매핑을 해아할까요??저희가 ERD를 설계할 때 HashTag_Challenge 테이블에서 해시태그와 챌린지를 매핑하도록 설계했습니다.

## 개발 결과물 공유

---

[https://gitlab.com/minjikim99/devroutine](https://gitlab.com/minjikim99/devroutine)

![스크린샷 2023-01-20 오전 9.31.01.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/2706d4b9-f8d7-4e08-bb35-321cfb18bdb8/%E1%84%89%E1%85%B3%E1%84%8F%E1%85%B3%E1%84%85%E1%85%B5%E1%86%AB%E1%84%89%E1%85%A3%E1%86%BA_2023-01-20_%E1%84%8B%E1%85%A9%E1%84%8C%E1%85%A5%E1%86%AB_9.31.01.png)
